#!/usr/bin/env python
# -*- coding: utf-8 -*-
#
#  kodmorsa.py
#  

kod = {"a": ".-", "b": "-...", "c": "-.-", "d": "-..", "e": ".",
        "f": "..-.", "g": "--.", "h": "....", "i": "..", "j": ".---",
        "k": "-.-", "l": ".-..", "m": "--", "n": "-.", "o": "---",
        "p": ".--.", "q": "--.-", "r": ".-.", "s": "...", "t": "-",
        "u": "..-", "v": "...-", "w": ".--", "x": "-..-", "y": "-.--",
        "z": "--..", u"ą": ".-.-", u"ć": "-.-..", u"ę": "..-..",
        u"ł": ".-..-", u"ń": "--.--", u"ó": "---.", u"ś": "...---...",
        u"ż": "--..-.", u"ź": "--..-", "1": ".----", "2": "..---",
        "3": "...--", "4": "....-", "5": ".....", "6": "-.....",
        "7": "--...", "8": "---..", "9": "----.", "0": "-----",
        ".": ".-.-.-", ",": "--..--", "'": ".----.", "_": "..--.-",
        ":": "---...", "?": "..--..", "-": "-...-",
        "(": "-.--.", ")": "-.--.-", "=": "-...-", "@": ".--.-."}

def koduj():
    tekst = input('Podaj tekst: ').lower()
    #  print("".join(kod[l] for l in tekst]))
    for l in tekst:
        print(kod[l])
        
def dekoduj():
    tekst = []
    litera = ' '
    while litera > '':
        litera = input('Podaj kod morsa: ')
        tekst.append(litera)
    print(tekst)

def main(args):
    dekoduj()
    return 0

if __name__ == '__main__':
    import sys
    sys.exit(main(sys.argv))
